* Generate a JPG image with jpge package

#+begin_src R :results output :exports both :session *R-local*
library(jpeg)

img <- readJPEG("./nvJPEG-Decoder/input_images/cat.jpg", native=FALSE)
#img

white_image = array(c(rep(1, 25), rep(0.5, 50)), dim=c(5,5,3))
white_image

writeJPEG(white_image, target = "./white_image.jpg", quality = 0.9, color.space = "RGB")
#+end_src

#+RESULTS:
#+begin_example
, , 1

     [,1] [,2] [,3] [,4] [,5]
[1,]    1    1    1    1    1
[2,]    1    1    1    1    1
[3,]    1    1    1    1    1
[4,]    1    1    1    1    1
[5,]    1    1    1    1    1

, , 2

     [,1] [,2] [,3] [,4] [,5]
[1,]  0.5  0.5  0.5  0.5  0.5
[2,]  0.5  0.5  0.5  0.5  0.5
[3,]  0.5  0.5  0.5  0.5  0.5
[4,]  0.5  0.5  0.5  0.5  0.5
[5,]  0.5  0.5  0.5  0.5  0.5

, , 3

     [,1] [,2] [,3] [,4] [,5]
[1,]  0.5  0.5  0.5  0.5  0.5
[2,]  0.5  0.5  0.5  0.5  0.5
[3,]  0.5  0.5  0.5  0.5  0.5
[4,]  0.5  0.5  0.5  0.5  0.5
[5,]  0.5  0.5  0.5  0.5  0.5
#+end_example

